cfg/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/Банки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Банки</Name>
			<Comment>(Общ) Классификатор банков</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Comment>(Регл) Корреспонденский счет банка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефоны</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/Контрагенты/Forms/ФормаПодбораИзКлассификатора/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии()

	Макет = Справочники.Банки.ПолучитьМакет("КлассификаторБанков");

	Макет.Параметры.Расшифровка = Истина; // чтобы работала расшифровка

	ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;

	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Вывести(Макет);

	ТабличныйДокумент.ФиксацияСверху = ТабличныйДокумент.Области.ОбластьРасшифровки.Верх - 1;

	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку     = Ложь;
	ТабличныйДокумент.ТолькоПросмотр      = Истина;

КонецПроцедуры

// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	// Получение значений полей выбранной строки.

	ТабличныйДокумент = ЭлементыФормы.ПолеТабличногоДокумента;
	ТекущаяОбласть    = ТабличныйДокумент.ТекущаяОбласть;

	ОбластьКодМФО         	= ТабличныйДокумент.Области.КодМФО;
	ОбластьНаименование 	= ТабличныйДокумент.Области.Наименование;
	ОбластьГород  			= ТабличныйДокумент.Области.Город;
	ОбластьАдрес  			= ТабличныйДокумент.Области.Адрес;
	ОбластьЕДРПОУ  			= ТабличныйДокумент.Области.ЕДРПОУ;
	ОбластьТелефоны			= ТабличныйДокумент.Области.Телефоны;
	ОбластьКоррСчет			= ТабличныйДокумент.Области.КоррСчет;

		КодМФО         	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодМФО.        	Лево, ТекущаяОбласть.Низ, ОбластьКодМФО.        Право).Текст;
		Наименование 	= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименование.  	Лево, ТекущаяОбласть.Низ, ОбластьНаименование.  Право).Текст;
		Город  			= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьГород.  		Лево, ТекущаяОбласть.Низ, ОбластьГород.  		Право).Текст;
		Адрес  			= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьАдрес.  		Лево, ТекущаяОбласть.Низ, ОбластьАдрес.  		Право).Текст;
		ЕДРПОУ  		= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьЕДРПОУ.  		Лево, ТекущаяОбласть.Низ, ОбластьЕДРПОУ.  		Право).Текст;
		Телефоны		= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьТелефоны.  		Лево, ТекущаяОбласть.Низ, ОбластьТелефоны.  	Право).Текст;
		КоррСчет		= ТабличныйДокумент.Область(ТекущаяОбласть.Верх, ОбластьКоррСчет.  		Лево, ТекущаяОбласть.Низ, ОбластьКоррСчет.  	Право).Текст;
		
		ПолныйАдрес = "Україна,,,,"+Город+",,"+Адрес+",,";
		
		// Проверка наличия выбранного банка.

		Ссылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодПоЕДРПОУ",ЕДРПОУ);

		Если НЕ Ссылка.Пустая() Тогда
			Вопрос = НСтр("ru='В справочнике ""Контрагенты"" уже существует элемент с кодом ЕГРПОУ ""';uk='У довіднику ""Контрагенти"" вже існує елемент з кодом ЄДРПОУ ""'") + ЕДРПОУ + НСтр("ru='""! Вы уверны, что нужно добавить новый?';uk='""! Ви впевнені, що потрібно додати новий?'");
			Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );

			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Ссылка.ПолучитьФорму( , ВладелецФормы, ).Открыть();
				Возврат;			
			ИначеЕсли Ответ = КодВозвратаДиалога.Отмена  Тогда		
				Возврат;
			КонецЕсли;
		КонецЕсли;

		// Создание нового банка.

		ФормаНовогоЭлемента = Справочники.Контрагенты.ПолучитьФормуНовогоЭлемента(, ВладелецФормы, );

		ФормаНовогоЭлемента.Наименование    = Наименование;
		ФормаНовогоЭлемента.НаименованиеПолное    = Наименование;
		ФормаНовогоЭлемента.КодПоЕДРПОУ     = ЕДРПОУ;

		ФормаНовогоЭлемента.Открыть();

		СтруктураАдрес = УправлениеКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПолныйАдрес);
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[1].Поле4 = СтруктураАдрес.Город;
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[1].Поле6 = СтруктураАдрес.Улица;
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[1].Поле7 = СтруктураАдрес.Дом;
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[1].Представление = УправлениеКонтактнойИнформацией.ПолучитьПредставлениеАдреса(ФормаНовогоЭлемента.НаборКонтактнойИнформации[1]);
		
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[4].Представление = Телефоны;
		ФормаНовогоЭлемента.НаборКонтактнойИнформации[4].Поле3 = Телефоны;

КонецПроцедуры
